Core/src/DataProcessors/ОбработкаИзменениеЦен/ОбработкаИзменениеЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаИзменениеЦен</name>
</mdclass:DataProcessor>

Core/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>ВключаяХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/DataProcessors/ОбработкаИзменениеЦен/Forms/Форма/Module.bsl
&НаСервере
Процедура ОбновитьСписокНаСервере()
	
	ТаблицаЦен.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатуры.ВидЦен,
	               |	ЦеныНоменклатуры.Номенклатура,
	               |	ЦеныНоменклатуры.Характеристика,
	               |	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	               |ПОМЕСТИТЬ ВТПериоды
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	               |ГДЕ
	               |	ЦеныНоменклатуры.ВидЦен В(&ВидЦен)
	               |	И ЦеныНоменклатуры.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЦеныНоменклатуры.ВидЦен,
	               |	ЦеныНоменклатуры.Номенклатура,
	               |	ЦеныНоменклатуры.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатуры.ВидЦен,
	               |	ЦеныНоменклатуры.Номенклатура,
	               |	ЦеныНоменклатуры.Характеристика,
	               |	ЦеныНоменклатуры.Цена
	               |ПОМЕСТИТЬ ВТЦеныСтар
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&ДатаКон,
	               |			ВидЦен В (&ВидЦен)
	               |				И НЕ (ВидЦен, Номенклатура, Характеристика, Период) В
	               |						(ВЫБРАТЬ
	               |							ЦеныНоменклатуры.ВидЦен,
	               |							ЦеныНоменклатуры.Номенклатура,
	               |							ЦеныНоменклатуры.Характеристика,
	               |							ЦеныНоменклатуры.Период
	               |						ИЗ
	               |							ВТПериоды КАК ЦеныНоменклатуры
	               |						ГДЕ
	               |							ЦеныНоменклатуры.ВидЦен В (&ВидЦен)
	               |							И ЦеныНоменклатуры.Период МЕЖДУ &ДатаНач И &ДатаКон)) КАК ЦеныНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТПериоды.ВидЦен,
	               |	ВТПериоды.Номенклатура,
	               |	ВТПериоды.Характеристика,
	               |	ВТПериоды.Период,
	               |	ЦеныНоменклатуры.Цена КАК ЦенаНов,
	               |	ВТЦеныСтар.Цена КАК ЦенаСтар,
	               |	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) - ЕСТЬNULL(ВТЦеныСтар.Цена, 0) КАК Разница
	               |ИЗ
	               |	ВТПериоды КАК ВТПериоды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	               |		ПО ВТПериоды.ВидЦен = ЦеныНоменклатуры.ВидЦен
	               |			И ВТПериоды.Период = ЦеныНоменклатуры.Период
	               |			И ВТПериоды.Номенклатура = ЦеныНоменклатуры.Номенклатура
	               |			И ВТПериоды.Характеристика = ЦеныНоменклатуры.Характеристика
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦеныСтар КАК ВТЦеныСтар
	               |		ПО ВТПериоды.ВидЦен = ВТЦеныСтар.ВидЦен
	               |			И ВТПериоды.Номенклатура = ВТЦеныСтар.Номенклатура
	               |			И ВТПериоды.Характеристика = ВТЦеныСтар.Характеристика
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Разница УБЫВ";
	
	
	Запрос.УстановитьПараметр("ДатаНач",?(ЗначениеЗаполнено(ДатаНач),ДатаНач,Дата("1,1,1")));
	Запрос.УстановитьПараметр("ДатаКон",?(ЗначениеЗаполнено(ДатаКон),ДатаКон,ТекущаяДата()));
	
	Запрос.УстановитьПараметр("ВидЦен",ВидыЦен);
	
	ТаблицаЦен.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенВидЦенНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенВидЦенНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенВидЦенОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
		
КонецПроцедуры

&НаСервере
Процедура ВидыЦенПриИзмененииНаСервере()
	
	ДопустимыеВидыЦен = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(,"ДопустимыеВидыЦен");
		
	Если ЗначениеЗаполнено(ДопустимыеВидыЦен) Тогда
		Для Каждого Стр Из ВидыЦен Цикл 
			
			СтруктураОтбора = Новый Структура("ВидЦен",Стр.Значение);
			
			Строки = ДопустимыеВидыЦен.ВидыЦен.НайтиСтроки(СтруктураОтбора);
			
			Если Строки.Количество() = 0 Тогда	
				ВидыЦен.Удалить(Стр);
			КонецЕсли;
			
		КонецЦикла;
	Иначе 	
		Возврат;		
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенПриИзменении(Элемент)
	ВидыЦенПриИзмененииНаСервере();
КонецПроцедуры
